#include <iostream>
using namespace std;






			// ЗАДАНИЕ 1:
/*Вывести на экран один куплет любимого стихотворения
или песни, с указанием автора или исполнителя.Используйте
escape - последовательности для форматирования.*/

//void main()
//{
//	setlocale(LC_ALL, "ru");
//	cout << "\tА.С.Пушкин \"Зимнее утро\"" << endl << endl;
//	cout << "\tМороз и солнце; день чудесный!" <<	endl;
//	cout << "\tЕщё ты дремлешь, друг прелестный" << endl;
//	cout << "\tПора, красавица, проснись:" <<	endl;
//	cout << "\tОткрой сомкнуты негой взоры" << endl;
//	cout << "\tНавстречу северной Авроры," << endl;
//	cout << "\tЗвездою севера явись!" << endl << endl;
//	system("pause");
//}

			// ЗАДАНИЕ 2:
/*Вывести на экран стих «Every hunter wants…» таким образом,
чтобы каждый «цвет» начинался с новой строки и соответствующим количеством табуляций.*/

//void main()
//{
//	setlocale(LC_ALL, "ru");
//	cout << "Каждый" << endl;
//	cout << "\tохотник" <<	endl;
//	cout << "\t\tжелает" << endl;
//	cout << "\t\t\tзнать" <<	endl;
//	cout << "\t\t\t\tгде" << endl;
//	cout << "\t\t\t\t\tсидит" << endl;
//	cout << "\t\t\t\t\t\tфазан" << endl;
//	system("pause");
//}

			// ЗАДАНИЕ 3:
/*Напишите объявление о продаже чего-нибудь и выведите его на экран,
в том виде как оно должно было бы быть напечатано.
*/

//void main()
//{
//	setlocale(LC_ALL, "ru");
//	cout << "\t\t\tПродам хоккейные коньки." << endl << endl;
//	cout << "\t\t\tМодель: Bauer Supreme M1." <<	endl << endl;
//	cout << "\t\t\t..." << endl << endl;
//	cout << "\t\t\tТел.:999-88-77" <<	endl;
//	cout << "\t\t\t999\t| 999 |" << endl;
//	cout << "\t\t\t88 \t| 88  |" << endl;
//	cout << "\t\t\t77 \t| 77  |" << endl << endl;
//	system("pause");
//}