namespace SystemProgramming_HW_3;

public static class Constants
{
    public static readonly int TimeDelay = 500;

    public static readonly string[] Commands =
        [
            "F1  - Запустить генерацию простых чисел",
            "F2  - Запустить генерацию чисел Фибоначчи (только при запущенной генерации простых чисел!)",
            "F3  - Приостановить генерацию простых чисел",
            "F4  - Приостановить генерацию чисел Фибоначчи",
            "F5  - Возобновить генерацию простых чисел",
            "F6  - Возобновить генерацию чисел Фибоначчи",
            "F7  - Завершить генерацию простых чисел",
            "F8  - Завершить генерацию чисел Фибоначчи",
            "F9  - Перезапустить генерацию простых чисел и чисел Фибоначчи",
            "F10 - Выход"
        ];
}